app/Controllers/CategoriaPecaController.php

    public function listar()
    {
        echo view("layouts/header",[
            "itens" => $this->categoria_peca->orderBy("nome")->paginate(10),
            "pager" => $this->categoria_peca->pager
        ]);
---
SELECT *
FROM `categoria_peca`
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categoria_peca`

    public function onSave()
    {
        $resultado = $this->categoria_peca->save($this->request->getPost());
---
INSERT INTO `categoria_peca` (`nome`) VALUES ('Parafuso')
UPDATE `categoria_peca` SET `nome` = 'Arruela'
WHERE `categoria_peca`.`idCategoriaPeca` IN ('5')