app/Controllers/CategoriaServicoController.php

    public function listar()
    {
        echo view("layouts/header",[
            "itens"=>$this->categoria_servico->orderBy("nome")->paginate(10),
            "pager"=>$this->categoria_servico->pager
        ]);
---
SELECT *
FROM `categoria_servico`
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categoria_servico`