app/Controllers/CategoriaMaquinarioController.php

    public function listar()
    {
        echo view("layouts/header",[
            "itens" => $this->categoria_maquinario->orderBy("nome")->paginate(2),
            "pager" => $this->categoria_maquinario->pager
        ]);
---
SELECT *
FROM `categoria_maquinario`
ORDER BY `nome`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `categoria_maquinario`