app/Controllers/CidadeController.php

    public function listar()
    {
        echo view("layouts/header",[
            "itens" => $this->cidade->orderBy("nome")->paginate(10),
            "pager" => $this->cidade->pager
        ]);
---
SELECT *
FROM `cidade`
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `cidade`