app/Controllers/EstadoController.php

    public function listar()
    {
        echo view("layouts/header",[
            "itens"=>$this->estado->orderBy("nome")->paginate(10),
            "pager"=>$this->estado->pager
        ]);
---
SELECT *
FROM `estado`
ORDER BY `nome`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `estado`

    public function onSave(){

        $status = $this->estado->save($this->request->getPost());
---
INSERT INTO `estado` (`nome`, `sigla`) VALUES ('Rio Grande do Sul', 'RS')