app/Controllers/LoginController.php

SELECT *
FROM `usuario`
WHERE `email` = 'vagnerrgsb@gmail.com'
 LIMIT 1
---
    public function onLogin()
    {
        $validate = $this->validate([
            "email" => "required|valid_email",
            "senha" => "required"
        ]);

        if(!$validate){
            return redirect()->route("login.tela")->with("errors", $this->validator->getErrors());
        }else{
            $usuario_login = $this->usuario->where(
                "email",$this->request->getPost("email"))->first();