app/Controllers/MarcaController.php

SELECT *
FROM `marca`
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `marca`
---
    public function listar()
    {
        echo view("layouts/header",[
            "itens" => $this->marca->orderBy("nome")->paginate(10),
            "pager" => $this->marca->pager
        ]);