app/Controllers/ModeloMaquinarioController.php

SELECT *
FROM `modelo_maquinario`
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `modelo_maquinario`
---
    public function listar()
    {

        /**
         * INNER JOIN PARA RETORNAR CATEGORIA MAQUINARIO.NOME MARCA.NOME E MODELO_MAQUINARIO.NOME
         * select cm.nome, ma.nome, mm.nome
         * from modelo_maquinario mm
         * inner join categoria_maquinario cm on mm.idCategoriaMaquinario=cm.idCategoriaMaquinario
         * inner join marca ma on mm.idMarca=ma.idMarca;
         */

        echo view("layouts/header", [
            "itens" => $this->modelo_maquinario->orderBy("nome")->paginate(10),
            "pager" => $this->modelo_maquinario->pager

        ]);