app/Controllers/ModeloMaquinarioController.php

    public function inserir()
    {
        echo view("layouts/header", [
            "marcas" => $this->marca->findAll(),
            "categorias" => $this->categoria_maquinario->findAll()
        ]);
---
SELECT *
FROM `marca`
SELECT *
FROM `categoria_maquinario`

    public function editar($param_marca, $param_categoria)
    {
        echo view("layouts/header",[
            "marcas" => $this->marca->findAll(),
            "item_marca" => $this->marca->find($param_marca),
            "categorias" => $this->categoria_maquinario->findAll(),
            "item_categoria" => $this->categoria_maquinario->find($param_categoria)
        ]);
---
SELECT *
FROM `marca`
SELECT *
FROM `categoria_maquinario`

    public function onSave()
    {
        $resultado = $this->modelo_maquinario->save($this->request->getPost());
---
INSERT INTO `modelo_maquinario` (`idMarca`, `idCategoriaMaquinario`, `nome`) VALUES ('3', '1', '580 N')