app/Controllers/ModeloController.php

    public function inserir()
    {
        $marcas = $this->marca->select(
            "idMarca, nome as nomeMarca"
        )->findAll();
        $maquinarios = $this->maquinario->select(
            "idMaquinario, nome as nomeMaquinario"
        )->findAll();
---
SELECT `idMarca`, `nome` as `nomeMarca`
FROM `marca`
SELECT `idMaquinario`, `nome` as `nomeMaquinario`
FROM `maquinario`