app/Controllers/UsuarioController.php

    public function listar()
    {
        $id = [session("logado")["idUsuario"]];
        echo view("layouts/header", [
            //"itens" => $this->usuario->findAll(),
            "itens" => $this->usuario->whereNotIn("idUsuario", $id)->orderBy("nome")->paginate(10),
---
SELECT *
FROM `usuario`
WHERE `idUsuario` NOT IN ('1')
ORDER BY `nome`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuario`
WHERE `idUsuario` NOT IN ('1')